{
  "Home": {
    "title": "Добро пожаловать в Pokémon App"
  },
  "Header": {
    "about": "О приложении",
    "main": "Главная"
  },
  "Top-controls": {
    "title": "Найди своего Покемона",
    "placeholder": "Введите полное имя покемона...",
    "loading": "Загрузка...",
    "search": "Поиск",
    "retry": "Попробовать снова"
  },
  "Results": {
    "title": "РЕЗУЛЬТАТЫ:",
    "select": "Выбрать",
    "name": "Имя покемона",
    "description": "Описание покемона"
  },
  "App": {
    "prev": "Назад",
    "next": "Вперед",
    "page": "Страница",
    "updateList": "Обновить список",
    "updateSingle": "Обновить {name}",
    "crash": "Сломать приложение!"
  },
  "Popup": {
    "selected": "Выбрано элементов: {count}",
    "deselect": "Снять выделение",
    "download": "Скачать CSV"
  },
  "Details": {
    "types": "Типы:",
    "abilities": "Способности:",
    "stats": "Характеристики:"
  },
  "About": {
    "title": "Обо мне",
    "greet": "Привет! Я Таня 👋",
    "p1": "Однажды я просто искала что-то «для души» — и неожиданно попала в увлекательный мир фронтенда.",
    "p2": "Моё путешествие началось с курсов RS School, и это была любовь с первого \"div\". Я прошла Stage 0, Stage 1 и Stage 2, а сейчас глубоко погружаюсь в React — чем глубже, тем больше мне нравится. До фронтенда я изучала Python, но именно фронтенд зажёг во мне творческую искру: создаёшь что-то, видишь, как оно оживает — и снова влюбляешься в процесс. Но жизнь не только про код 🙂",
    "p3": "В свободное время я увлекаюсь цифровым рисованием, 3D-моделированием и анимацией. Обожаю готовить (особенно когда мои мальчики просят добавки!), читаю как классику, так и современную литературу, играю на PS5 и остаюсь активной благодаря спорту 💪",
    "p4": "По натуре я добрый и открытый человек. Люблю учиться, не боюсь ошибок и верю, что любую багу можно победить, если не сдаваться. Люблю работать в команде, ценю честный фидбэк и стараюсь всегда привносить позитивную энергию в то, что делаю. Добро пожаловать в мой маленький мир — где фронтенд это магия, а код — мой способ выразить её 💻✨"
  }
}
